sCO2Channel-DES_1.03_500_20/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 303; 

boundaryField
{
    BotWall1
    {
        type            compressible::turbulentHeatFluxTemperature;
        heatSource      flux;        // power [W]; flux [W/m2]
        q               uniform 0;  // heat power or flux
        kappa           fluidThermo; // calculate kappa=alphaEff*thermo.Cp
        kappaName       none;        //ASR - is this ok, will it generate kappa if I specify none?
        Qr              none;        // name of the radiative flux
        value           uniform 0; // initial temperature value
    }
    BotWall2
    {
        type            compressible::turbulentHeatFluxTemperature;
        heatSource      flux;        // power [W]; flux [W/m2]
        q               uniform 201109;  // heat power or flux
        kappa           fluidThermo; // calculate kappa=alphaEff*thermo.Cp
        kappaName       none;        //ASR - is this ok, will it generate kappa if I specify none?
        Qr              none;        // name of the radiative flux
        value           uniform 0; // initial temperature value
    }
    OtherWalls
    {
		type            zeroGradient;
    }
    
    Inlet
    {
        type            fixedValue;
        value           uniform 303; 
    }
    Outlet
    {
        type            advective;
        phi             phi;
        rho             rho;
    }
}

// ************************************************************************* //
